Update content src/site/notes/Promises of Victory/General/Storys/Storys.md
