--- a/src/site/notes/Promises of Victory/General/Storys/Storys.md
+++ b/src/site/notes/Promises of Victory/General/Storys/Storys.md
@@ -12,83 +12,86 @@
 
 
+This is BS and outdated ...
+```mermaid
+graph TD
+Start
 
-```plantuml
+Start --> Witch_Fight[Player fights the Witch]
+Start --> Bwomsamdi[Player find Nosem]
+Start --> Death_Energy
 
-Witch_Fight: Player fights the Witch
-Bwomsamdi: Player find Nosem
+Witch_Fight -.-> UNKNOWN[Players find that the Witch channels Energy into Ritual] 
 
-Witch_Fight -d-> UNKNOWN : "Players find that the Witch channels Energy into Ritual (witch memories)"
 
-[*] -d-> Death_Energy
+subgraph Adventure_hook_dragons
+  Start --> Tavern
+  Tavern --> Sturmklau[player gets a quest to hunt a dragon]
+  Sturmklau --> Sturmklau_Attack[druid City of Sturmklau gets attacked by the Shaddowhammer Clan]
+end
 
-state Adventure_hook_dragons{
-    Tavern -d-> Sturmklau: player gets a quest to hunt a dragon
-}
+subgraph Life_Artefact
+  Forge_of_Life[the player brings the artifact to the forge of life]
+  Player_Run_With_artifact[to save the artifact the druids give the artifact to the player]
+  Sturmklau -->|time passes| Sturmklau_Attack
+  Sturmklau_Attack -->|player fight through the city and reach the artifact| Player_Run_With_artifact
+  Player_Run_With_artifact -->|"Players get a fake help call from the Druids"| Forge_of_Life
+end
 
-[*] -d-> Tavern
 
-state Life_Artefact{
-    Sturmklau_Attack : druid City of Sturmklau gets attacked by the Shaddowhammer Clan
-    Forge_of_Life : the player brings the artifact to the forge of life
-    Player_Run_With_artifact : to save the artifact the druids give the artifact to the player
+subgraph Jamoke
+  Prince_Reveal[Player find out that the player Jamoke is a Prince]
+  Dream_Sequence[Player gets Gem of the Dreamer]
+  Build_Chain[Player builds the chain to find the Sister]
 
-    Sturmklau -d-> Sturmklau_Attack: time passes
-    Sturmklau_Attack -d-> Player_Run_With_artifact : player fight through the city and reach the artifact
-    Player_Run_With_artifact -d-> Forge_of_Life: Players get a fake help call from the Druids
-}
+  Prince_Reveal --> |triggered| Dream_Sequence
+  Dream_Sequence --> |Players find a smith that can build the chain| Build_Chain
+end
 
-state Jamoke{
-    Prince_Reveal: Player find out that the player Jamoke is a Prince
-    Dream_Sequence: Player gets Gem of the Dreamer
-    Build_Chain: Player builds the chain to find the Sister
 
-    Prince_Reveal -d-> Dream_Sequence: triggered
-    Dream_Sequence -d-> Build_Chain: Players find a smith that can build the chain
-}
+subgraph Chaos_Artefact
+    Start --> Player_Has_Chaos_Artefact[Player gets artifact at beginning of game]
+    Doctor_Phalandos_Office_raided[Player find Mad Doctor dead & fight Shaddowhammer General]
+    Forge_of_Chaos[Player brings artifact to forge of chaos]
 
-state Chaos_Artefact{
-    Doctor_Phalandos_Office_raided : Player find the Mad Doctor dead and fight a Shaddowhammer General
-    Forge_of_Chaos : Player brings the artifact to the forge of chaos
-    Player_Has_Chaos_Artefact : Player gets the artifact at the beginning of the game
+    Player_Has_Chaos_Artefact -->|Should be Brought there for Safekeeping| Doctor_Phalandos_Office_raided
+    Doctor_Phalandos_Office_raided  -->|Fake Notes to stop Ritual and Bind Chain| Forge_of_Chaos
+    Build_Chain --> |look at chain in falk| Forge_of_Chaos
+end
 
-    Player_Has_Chaos_Artefact -d-> Doctor_Phalandos_Office_raided: Should be Brought there for Safekeeping
-    Doctor_Phalandos_Office_raided  -d-> Forge_of_Chaos: Fake Notes to stop Ritual and "bind chain"
-    Build_Chain -d-> Forge_of_Chaos: look at chain in falk
-}
-[*] -d-> Player_Has_Chaos_Artefact
 
-state Light_Artefact{
-    Herbstbog: Player unveil corruption
-    Düsternest: Player fight the Witch
-    Lichtachte_Cathedral: Player rob the Cathedral for Artifact
-    Archaelogy_Site: Player find the arcane device
+Player_Has_Chaos_Artefact
 
-    Herbstbog -d-> Archaelogy_Site: Player find Notes
-    Forge_of_Light: Player race to Forge with Volair, fight him, tells his Truth
-    Düsternest -d-> Lichtachte_Cathedral
-    Lichtachte_Cathedral -d-> Forge_of_Light
-    Archaelogy_Site -d-> Forge_of_Light
-}
+subgraph Light_Artefact
+    Herbstbog[Player unveil corruption]
+    Düsternest[Player fight the Witch]
+    Lichtachte_Cathedral[Player rob Cathedral for Artifact]
+    Archaelogy_Site[Player find arcane device]
 
-state Death_Energy{
+    Herbstbog -->|Player find Notes| Archaelogy_Site
+    Forge_of_Light[Player race to Forge with Volair, fight him, tells his Truth]
+    Düsternest --> Lichtachte_Cathedral
+    Lichtachte_Cathedral --> Forge_of_Light
+    Archaelogy_Site --> Forge_of_Light
+end
 
+subgraph Death_Energy
+  
+end
+
+Forge_of_Life --> Final_Sacrifice
+
+Forge_of_Chaos --> Final_Sacrifice
+
+Forge_of_Light --> Final_Sacrifice
+
+Death_Energy --> Final_Sacrifice
+
+subgraph Final_Sacrifice
     
+  Below_Edschmied[Bomb goes down]
+  Final_fight_Narun[Player fights Narun]
 
-}
-
-Forge_of_Life -d-> Final_Sacrifice
-Forge_of_Chaos -d-> Final_Sacrifice
-Forge_of_Light -d-> Final_Sacrifice
-Death_Energy -d-> Final_Sacrifice
-
-state Final_Sacrifice{
-
-
-    Below_[[Edschmied]]: Bomb goes down
-    Final_fight_Narun: Player fights Narun
-}
-
+end
 
 ```
-
